<script lang="ts">
</script>

<div class="navbar bg-primary fixed z-50 shadow-lg">
    <div class="navbar-start">
        <div class="btn btn-ghost normal-case text-xl text-primary-content">
            MissLI
        </div>
    </div>
    <div class="navbar-end">
        <div
            class="tooltip tooltip-bottom fill-primary-content mx-8"
            data-tip="設定"
        >
            <label
                class="btn btn-circle btn-ghost p-1 -mb-2"
                for="settings-modal"
            >
                <!-- 設定アイコン -->
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"
                    ><title>cog-outline</title><path
                        d="M12,8A4,4 0 0,1 16,12A4,4 0 0,1 12,16A4,4 0 0,1 8,12A4,4 0 0,1 12,8M12,10A2,2 0 0,0 10,12A2,2 0 0,0 12,14A2,2 0 0,0 14,12A2,2 0 0,0 12,10M10,22C9.75,22 9.54,21.82 9.5,21.58L9.13,18.93C8.5,18.68 7.96,18.34 7.44,17.94L4.95,18.95C4.73,19.03 4.46,18.95 4.34,18.73L2.34,15.27C2.21,15.05 2.27,14.78 2.46,14.63L4.57,12.97L4.5,12L4.57,11L2.46,9.37C2.27,9.22 2.21,8.95 2.34,8.73L4.34,5.27C4.46,5.05 4.73,4.96 4.95,5.05L7.44,6.05C7.96,5.66 8.5,5.32 9.13,5.07L9.5,2.42C9.54,2.18 9.75,2 10,2H14C14.25,2 14.46,2.18 14.5,2.42L14.87,5.07C15.5,5.32 16.04,5.66 16.56,6.05L19.05,5.05C19.27,4.96 19.54,5.05 19.66,5.27L21.66,8.73C21.79,8.95 21.73,9.22 21.54,9.37L19.43,11L19.5,12L19.43,13L21.54,14.63C21.73,14.78 21.79,15.05 21.66,15.27L19.66,18.73C19.54,18.95 19.27,19.04 19.05,18.95L16.56,17.95C16.04,18.34 15.5,18.68 14.87,18.93L14.5,21.58C14.46,21.82 14.25,22 14,22H10M11.25,4L10.88,6.61C9.68,6.86 8.62,7.5 7.85,8.39L5.44,7.35L4.69,8.65L6.8,10.2C6.4,11.37 6.4,12.64 6.8,13.8L4.68,15.36L5.43,16.66L7.86,15.62C8.63,16.5 9.68,17.14 10.87,17.38L11.24,20H12.76L13.13,17.39C14.32,17.14 15.37,16.5 16.14,15.62L18.57,16.66L19.32,15.36L17.2,13.81C17.6,12.64 17.6,11.37 17.2,10.2L19.31,8.65L18.56,7.35L16.15,8.39C15.38,7.5 14.32,6.86 13.12,6.62L12.75,4H11.25Z"
                    /></svg
                >
            </label>
        </div>
        <div class="tooltip tooltip-left" data-tip="リポジトリを見る">
            <a
                class="btn btn-circle btn-ghost fill-primary-content p-1 -mb-2"
                href="https://github.com/uboar/missli"
                target="_blank"
                rel="noreferrer"
            >
                <!-- GitHubアイコン -->
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"
                    ><title>github</title><path
                        d="M12,2A10,10 0 0,0 2,12C2,16.42 4.87,20.17 8.84,21.5C9.34,21.58 9.5,21.27 9.5,21C9.5,20.77 9.5,20.14 9.5,19.31C6.73,19.91 6.14,17.97 6.14,17.97C5.68,16.81 5.03,16.5 5.03,16.5C4.12,15.88 5.1,15.9 5.1,15.9C6.1,15.97 6.63,16.93 6.63,16.93C7.5,18.45 8.97,18 9.54,17.76C9.63,17.11 9.89,16.67 10.17,16.42C7.95,16.17 5.62,15.31 5.62,11.5C5.62,10.39 6,9.5 6.65,8.79C6.55,8.54 6.2,7.5 6.75,6.15C6.75,6.15 7.59,5.88 9.5,7.17C10.29,6.95 11.15,6.84 12,6.84C12.85,6.84 13.71,6.95 14.5,7.17C16.41,5.88 17.25,6.15 17.25,6.15C17.8,7.5 17.45,8.54 17.35,8.79C18,9.5 18.38,10.39 18.38,11.5C18.38,15.32 16.04,16.16 13.81,16.41C14.17,16.72 14.5,17.33 14.5,18.26C14.5,19.6 14.5,20.68 14.5,21C14.5,21.27 14.66,21.59 15.17,21.5C19.14,20.16 22,16.42 22,12A10,10 0 0,0 12,2Z"
                    /></svg
                >
            </a>
        </div>
    </div>
</div>

<input type="checkbox" id="settings-modal" class="modal-toggle" />
<label for="settings-modal" class="modal cursor-pointer">
    <div class="modal-box w-11/12 max-w-5xl">
        <h2 class="text-lg -mb-4">設定</h2>
        <div class="divider" />
        <div>
            とりあえず何か書いとけ
        </div>
        <div class="divider -mb-6" />
        <div class="modal-action -mb-4">
            <label for="settings-modal" class="btn btn-primary w-40"
                >閉じる</label
            >
        </div>
    </div>
</label>
